v13/poiseuilleFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1);

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }

    outlet
    {
        type            zeroGradient;
    }

    pipe
    {
        type            noSlip;

        // type            fixedValue;
        // value           uniform (0 0 0);
    }
}

// ************************************************************************* //
