v13/poiseuilleFlow/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// momentumSource
// {
//     type            semiImplicitSource;

//     cellZone        all;

//     volumeMode      specific;

//     sources
//     {
//         U
//         {
//             explicit    (5 0 0);
//             implicit    0;
//         }
//     }
// }


// ************************************************************************* //
