v13/poiseuilleFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          incompressibleFluid;

startFrom       startTime; // latestTime

startTime       0;

stopAt          endTime;

endTime         25;

deltaT          5e-2;

// writeControl    runTime;
writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary; // ascii

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.9;

maxDeltaT       1.; //1e-03;

// ************************************************************************* //
